// -----------------------------------------------------------------------------------------------------------
//                                                  Задача №13 
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// * Сделать вариант для числа длиной до 10 цифр не используя char или string
// -----------------------------------------------------------------------------------------------------------

void Variant1(int num)
{
    // Сообщение о варианте
    Console.WriteLine("Вариант решения - 1");
    // Преобразуем число в массив цифр представленном символами
    char[] digits = num.ToString().ToCharArray();
    // Проверяем, если длина массива больше 2 - то выводим сообщение с третьей цифрой
    if (digits.Length > 2) 
        { Console.WriteLine("Третья цифра числа: - " + digits[2]); }
    // Если длина массива менее 3 - Выводим сообщение об отсутствии третьей цифры
    else 
        { Console.WriteLine("Третьей цифры в указанном числе нет!"); }
}

void Variant2(int num)
{
    // Сообщение о варианте
    Console.WriteLine("Вариант решения - 2");

    // Проверяем на количество цифр в числе, третья цифра есть в числах больше 99
    if (num > 99)
    {
        // Запускаем цикл по уменьшению числа до трёхзначного 
        while (num > 999)  // Если число больше 999 (трёхзначного) заходим в цикл
        {
            num = num / 10;   // Производим целочисленное деление на 10 и результат записываем в переменную numb
        }
        // Выводим на экран сообщение с третьей цифрой введенного числа
        Console.WriteLine("Третья цифра числа: - " + num % 10);
    }
    else
    {
        // Если введенное число меньше 100, то выводим сообщение об отстутствии третьей цифры в числе
        Console.WriteLine("Третьей цифры в указанном числе нет!");
    }
}

Console.Write("Введите число: ");
// Считываем введенное число
int numb = int.Parse(Console.ReadLine() ?? "0");
// Вызываем метод с первым вариантом и передаем ему считанное число
Variant1(numb);
// Вызываем метод со вторым вариантом и передаем ему считанное число
Variant2(numb);