// -----------------------------------------------------------------------------------------------------------
//                                                  Задача №13 
// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// * Сделать вариант для числа длиной до 10 цифр не используя char или string
// -----------------------------------------------------------------------------------------------------------

Console.Write("Введите число: ");
// Считываем введенное число
int numb = int.Parse(Console.ReadLine()??"0");
// Проверяем на количество цифр в числе, третья цифра есть в числах больше 99
if (numb > 99)
{
    // Запускаем цикл по уменьшению числа до трёхзначного 
    while (numb > 999)  // Если число больше 999 (трёхзначного) заходим в цикл
    {
        numb = numb / 10;   // Производим целочисленное деление на 10 и результат записываем в переменную numb
    }
    // Выводим на экран сообщение с третьей цифрой введенного числа
    Console.WriteLine("Третья цифра числа: - " + numb % 10);
}    
else
{
    // Если введенное число меньше 100, то выводим сообщение об отстутствии третьей цифры в числе
    Console.WriteLine("Третьей цифры в указанном числе нет!");
}