// ----------------------------------------------------------------------------------------------------------------------------------------
//                                                          Задача №18
// Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
// ----------------------------------------------------------------------------------------------------------------------------------------


// Метод для ввода данных
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine()??"0");
    return num;
}
// По координатам точки определяем номер четверти
string QuoterBorderAsk(int numQut)
{
    if (numQut == 1) return "x > 0, y > 0";
    if (numQut == 2) return "x < 0, y > 0";
    if (numQut == 3) return "x < 0, y < 0";
    if (numQut == 4) return "x > 0, y < 0";
    return "0";
}
// Печатаем результат
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

int x = ReadData("Введите номер четверти: ");

PrintResult("Возможные значения координат: " + QuoterBorderAsk(x));