// -----------------------------------------------------------------------------------------------------------------------------------------------
// Внутри класса Answer напишите метод ShowCube, 
// который принимает на вход число (N) и выводит таблицу кубов чисел от 1 до N (включительно) каждое на новой строке.
// -----------------------------------------------------------------------------------------------------------------------------------------------

using System;

public class Answer
{
   static void ShowCube(int N)
    {
      // Введите свое решение ниже
        Console.WriteLine("N = " + N);
        for (int i = 1; i <= N; i++)        //В цикле перебираем числа от 1-го до N
        {
            Console.WriteLine(Math.Pow(i, 3));  // Вычисляем и выводим результат на экран 
        }
    }

  // Не удаляйте и не меняйте метод Main! 
      static public void Main(string[] args) {
        int N;

        if (args.Length >= 1) {
            N = int.Parse(args[0]);
        } else {
           // Здесь вы можете поменять значения для отправки кода на Выполнение
            N = 6;
        }

        // Не удаляйте строки ниже
        ShowCube(N);
    }
}