// ------------------------------------------------------------------------------------------------------------------------------
// Задача №20
// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
// ------------------------------------------------------------------------------------------------------------------------------

// Метод для ввода данных
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine()??"0");
    return num;
}

// Печатаем результат
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}
//Вычисляем расстояние между точками
double Calc2dDist(int x1, int x2, int y1, int y2)
{
    double res = Math.Sqrt((x1-x2)*(x1-x2) + (y1-y2)*(y1-y2));
    return res;
}

int x1 = ReadData("Введите координату X первой точки: ");            // Считываем введенное число

int y1 = ReadData("Введите координату Y первой точки: ");            // Считываем введенное число

int x2 = ReadData("Введите координату X второй точки: ");            // Считываем введенное число

int y2 = ReadData("Введите координату X первой точки: ");            // Считываем введенное число

string mes = Calc2dDist(x1,x2,y1,y2).ToString();        //Запускаем метод для вычислений
PrintResult("Расстояние между точками: " + mes);        //Выводим результат на экран