// --------------------------------------------------------------------------------------------------------------------
//                                                  Задание №10 
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// --------------------------------------------------------------------------------------------------------------------

Console.Write("Введите трёхзначное число: ");
// Считываем введенное число
int numb = int.Parse(Console.ReadLine()??"0");
// Преобразуем (распарсиваем) число на символы
char[] digit = numb.ToString().ToCharArray();
// Выводим на экран сообщение со второй цифрой числа
Console.WriteLine("Вторая цифра числа - " + digit[1]);