//--------------------------------------------------------------------------------------------------------
//                                              Задача №11
// Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
//--------------------------------------------------------------------------------------------------------

int num = new Random().Next(100,1000);
int firstDigit = num/100;
int lastDigit = num%10;
Console.WriteLine(num + " -> " + firstDigit + "" + lastDigit);