// --------------------------------------------------------------------------------------------------------------------------------------
//                                             Задача 64: 
// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
// --------------------------------------------------------------------------------------------------------------------------------------

// Метод Считывания с консоли
int ReadData(string msg)
{
    Console.Write(msg);
    int num = Convert.ToInt32(Console.ReadLine());
    return num;
}
// метод вывода чисел
void PrintResult(int n)
{
    if (n > 0)
    {
        if (n < 2)
            Console.Write(n);
        else
            Console.Write($"{n}, ");
        PrintResult(n - 1);
    }
}
PrintResult(ReadData("Введите число: "));