// -------------------------------------------------------------------------------------------------------------------------------------------------
// №43 Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.
// b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; 5,5)
// (Задание со звездочкой) Найдите площадь треугольника образованного пересечением 3 прямых
// ------------------------------------------------------------------------------------------------------------------------------------------------

// Метод для ввода данных
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine()??"0");
    return num;
}
// Метод вывода сообщения на экран
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}
//Метод нахождения пересечения
(double x, double y) CrossPoint(int b1, int k1, int b2, int k2)
{
    double cX = (double)(b2 - b1) / (k1 - k2);
    double cY = (double)(k1 * b2 - k2 * b1) / (k1 - k2);
    return (cX, cY);
}

int b1 = ReadData("Введите значение b1: ");
int k1 = ReadData("Введите значение k1: ");
int b2 = ReadData("Введите значение b2: ");
int k2 = ReadData("Введите значение k2: ");
(double x, double y) point = CrossPoint(b1,k1,b2,k2);
PrintResult(point.x + "; " + point.x);