// --------------------------------------------------------------------------------------------------------------------------------------
//                                                 Задача 66: 
// Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
// --------------------------------------------------------------------------------------------------------------------------------------

// Метод Считывания с консоли
int ReadData(string msg)
{
    Console.Write(msg);
    int num = Convert.ToInt32(Console.ReadLine());
    return num;
}
// Рекурентный метод для вычисления суммы чисел от m до n 
int CalcSum(int m, int n, int sum)
{
    if (m <= n)
    {
        sum += m;
        return CalcSum(m + 1, n, sum);
    }
    else
    {
        return sum;
    }
    
}
// Метод вывода на экран
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

int m = ReadData("введите начальное число (m): ");
int n = ReadData("введите начальное число (n): ");
PrintResult(CalcSum(m, n, 0).ToString());