// ----------------------------------------------------------------------------------------------------------------------------------
// Задача №28
// Напишите программу, которая принимает на вход число N и выдаёт произведение чисел от 1 до N.
// ----------------------------------------------------------------------------------------------------------------------------------

// Метод для ввода данных
int ReadData(string msg)
{
    Console.Write(msg);
    int num = int.Parse(Console.ReadLine()??"0");
    return num;
}
// Печатаем результат
void PrintResult(string msg)
{
    Console.WriteLine(msg);
}

long Fact(int numb)
{
    long res = 1;
    for (int i = 2; i <= numb; i++)
    {
        res *= i;
    }

    return res;
}

int num = ReadData("Введите число: ");
PrintResult("Факториал числа " + num + " = " + Fact(num));